/******************************************************************************/
/* ファイル名 : m46eapp_print_packet.h                                        */
/* 機能概要   : デバッグ用パケット表示関数 ヘッダファイル                     */
/* 修正履歴   : 2011.12.20 T.Maeda 新規作成                                   */
/*              2012.08.08 T.Maeda Phase4向けに全面改版                       */
/*              2016.04.15 H.Koganemaru 名称変更に伴う修正                    */
/*                                                                            */
/* ALL RIGHTS RESERVED, COPYRIGHT(C) FUJITSU LIMITED 2011-2016                */
/******************************************************************************/
#ifndef __M46EAPP_PRINT_PACKET_H__
#define __M46EAPP_PRINT_PACKET_H__

////////////////////////////////////////////////////////////////////////////////
// 外部関数プロトタイプ宣言
////////////////////////////////////////////////////////////////////////////////
void m46e_print_packet(char* packet);

#endif // __M46EAPP_PRINT_PACKET_H__
